src/main/resources/autotest/testreport/sysbench_point_select_20190505060321.log
sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 9624.93 qps: 9624.93 (r/w/o: 9624.93/0.00/0.00) lat (ms,95%): 0.29 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 9155.24 qps: 9155.24 (r/w/o: 9155.24/0.00/0.00) lat (ms,95%): 0.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 8290.90 qps: 8290.90 (r/w/o: 8290.90/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 8853.21 qps: 8853.21 (r/w/o: 8853.21/0.00/0.00) lat (ms,95%): 0.31 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 8325.43 qps: 8325.43 (r/w/o: 8325.43/0.00/0.00) lat (ms,95%): 0.36 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 7955.28 qps: 7955.28 (r/w/o: 7955.28/0.00/0.00) lat (ms,95%): 0.40 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 2 tps: 7326.25 qps: 7326.25 (r/w/o: 7326.25/0.00/0.00) lat (ms,95%): 0.42 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 2 tps: 8046.21 qps: 8046.21 (r/w/o: 8046.21/0.00/0.00) lat (ms,95%): 0.37 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 2 tps: 8268.24 qps: 8268.24 (r/w/o: 8268.24/0.00/0.00) lat (ms,95%): 0.36 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 2 tps: 7780.59 qps: 7780.59 (r/w/o: 7780.59/0.00/0.00) lat (ms,95%): 0.42 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 2 tps: 8810.78 qps: 8810.78 (r/w/o: 8810.78/0.00/0.00) lat (ms,95%): 0.31 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 2 tps: 8380.93 qps: 8380.93 (r/w/o: 8380.93/0.00/0.00) lat (ms,95%): 0.35 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 2 tps: 7540.02 qps: 7540.02 (r/w/o: 7540.02/0.00/0.00) lat (ms,95%): 0.40 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 2 tps: 9268.88 qps: 9268.88 (r/w/o: 9268.88/0.00/0.00) lat (ms,95%): 0.29 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 2 tps: 8201.37 qps: 8201.37 (r/w/o: 8201.37/0.00/0.00) lat (ms,95%): 0.37 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 2 tps: 7911.85 qps: 7911.85 (r/w/o: 7911.85/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 2 tps: 8402.25 qps: 8402.25 (r/w/o: 8402.25/0.00/0.00) lat (ms,95%): 0.34 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 2 tps: 8830.13 qps: 8830.13 (r/w/o: 8830.13/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1509741
        write:                           0
        other:                           0
        total:                           1509741
    transactions:                        1509741 (8387.32 per sec.)
    queries:                             1509741 (8387.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8387.3173
    time elapsed:                        180.0028s
    total number of events:              1509741

Latency (ms):
         min:                                    0.13
         avg:                                    0.24
         max:                                  132.30
         95th percentile:                        0.36
         sum:                               358887.72

Threads fairness:
    events (avg/stddev):           754870.5000/64.50
    execution time (avg/stddev):   179.4439/0.01

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 11257.21 qps: 11257.21 (r/w/o: 11257.21/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 11427.96 qps: 11427.96 (r/w/o: 11427.96/0.00/0.00) lat (ms,95%): 0.59 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 11436.98 qps: 11436.98 (r/w/o: 11436.98/0.00/0.00) lat (ms,95%): 0.60 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 11773.31 qps: 11773.31 (r/w/o: 11773.31/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 11151.19 qps: 11151.19 (r/w/o: 11151.19/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 9597.58 qps: 9597.58 (r/w/o: 9597.58/0.00/0.00) lat (ms,95%): 0.72 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 10138.35 qps: 10138.35 (r/w/o: 10138.35/0.00/0.00) lat (ms,95%): 0.69 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 10827.01 qps: 10827.01 (r/w/o: 10827.01/0.00/0.00) lat (ms,95%): 0.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 10832.95 qps: 10832.95 (r/w/o: 10832.95/0.00/0.00) lat (ms,95%): 0.67 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 12656.17 qps: 12656.17 (r/w/o: 12656.17/0.00/0.00) lat (ms,95%): 0.53 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 10085.15 qps: 10085.15 (r/w/o: 10085.15/0.00/0.00) lat (ms,95%): 0.70 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 9453.83 qps: 9453.83 (r/w/o: 9453.83/0.00/0.00) lat (ms,95%): 0.75 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 4 tps: 9592.53 qps: 9592.53 (r/w/o: 9592.53/0.00/0.00) lat (ms,95%): 0.74 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 4 tps: 9807.42 qps: 9807.42 (r/w/o: 9807.42/0.00/0.00) lat (ms,95%): 0.73 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 4 tps: 10538.51 qps: 10538.51 (r/w/o: 10538.51/0.00/0.00) lat (ms,95%): 0.65 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 4 tps: 10348.27 qps: 10348.27 (r/w/o: 10348.27/0.00/0.00) lat (ms,95%): 0.64 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 4 tps: 10990.59 qps: 10990.59 (r/w/o: 10990.59/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 4 tps: 12022.63 qps: 12022.63 (r/w/o: 12022.63/0.00/0.00) lat (ms,95%): 0.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1939397
        write:                           0
        other:                           0
        total:                           1939397
    transactions:                        1939397 (10773.67 per sec.)
    queries:                             1939397 (10773.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      10773.6660
    time elapsed:                        180.0127s
    total number of events:              1939397

Latency (ms):
         min:                                    0.11
         avg:                                    0.37
         max:                                  121.59
         95th percentile:                        0.64
         sum:                               718589.91

Threads fairness:
    events (avg/stddev):           484849.2500/8176.45
    execution time (avg/stddev):   179.6475/0.01

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 12018.23 qps: 12018.23 (r/w/o: 12018.23/0.00/0.00) lat (ms,95%): 1.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 12834.10 qps: 12834.10 (r/w/o: 12834.10/0.00/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 12838.06 qps: 12838.06 (r/w/o: 12838.06/0.00/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 12893.42 qps: 12893.42 (r/w/o: 12893.42/0.00/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 12618.53 qps: 12618.53 (r/w/o: 12618.53/0.00/0.00) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 12644.81 qps: 12644.81 (r/w/o: 12644.81/0.00/0.00) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 12878.94 qps: 12878.94 (r/w/o: 12878.94/0.00/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 12835.89 qps: 12835.89 (r/w/o: 12835.89/0.00/0.00) lat (ms,95%): 1.01 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 12494.25 qps: 12494.25 (r/w/o: 12494.25/0.00/0.00) lat (ms,95%): 1.03 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 11350.45 qps: 11350.45 (r/w/o: 11350.45/0.00/0.00) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 9640.34 qps: 9640.34 (r/w/o: 9640.34/0.00/0.00) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 8627.65 qps: 8627.65 (r/w/o: 8627.65/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 8 tps: 9375.48 qps: 9375.48 (r/w/o: 9375.48/0.00/0.00) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 8 tps: 10088.55 qps: 10088.55 (r/w/o: 10088.55/0.00/0.00) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 8 tps: 8231.86 qps: 8231.86 (r/w/o: 8231.86/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 8 tps: 9504.14 qps: 9504.14 (r/w/o: 9504.14/0.00/0.00) lat (ms,95%): 1.58 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 8 tps: 9645.19 qps: 9645.19 (r/w/o: 9645.19/0.00/0.00) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 8 tps: 11854.14 qps: 11854.14 (r/w/o: 11854.14/0.00/0.00) lat (ms,95%): 1.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2023777
        write:                           0
        other:                           0
        total:                           2023777
    transactions:                        2023777 (11242.27 per sec.)
    queries:                             2023777 (11242.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11242.2665
    time elapsed:                        180.0150s
    total number of events:              2023777

Latency (ms):
         min:                                    0.12
         avg:                                    0.71
         max:                                  226.41
         95th percentile:                        1.23
         sum:                              1438544.74

Threads fairness:
    events (avg/stddev):           252972.1250/2556.32
    execution time (avg/stddev):   179.8181/0.01

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 11987.08 qps: 11987.08 (r/w/o: 11987.08/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 10556.23 qps: 10556.23 (r/w/o: 10556.23/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 11843.69 qps: 11843.69 (r/w/o: 11843.69/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 11185.96 qps: 11185.96 (r/w/o: 11185.96/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 12109.54 qps: 12109.54 (r/w/o: 12109.54/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 11481.94 qps: 11481.94 (r/w/o: 11481.94/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 11891.84 qps: 11891.84 (r/w/o: 11891.84/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 12297.57 qps: 12297.57 (r/w/o: 12297.57/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 12239.55 qps: 12239.55 (r/w/o: 12239.55/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 12131.21 qps: 12131.21 (r/w/o: 12131.21/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 12369.91 qps: 12369.91 (r/w/o: 12369.91/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 12362.01 qps: 12362.01 (r/w/o: 12362.01/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 12385.88 qps: 12385.88 (r/w/o: 12385.88/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 11854.14 qps: 11854.14 (r/w/o: 11854.14/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 12265.03 qps: 12265.03 (r/w/o: 12265.03/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 12020.65 qps: 12020.65 (r/w/o: 12020.65/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 12155.37 qps: 12155.37 (r/w/o: 12155.37/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 12190.99 qps: 12190.99 (r/w/o: 12190.99/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2153337
        write:                           0
        other:                           0
        total:                           2153337
    transactions:                        2153337 (11961.34 per sec.)
    queries:                             2153337 (11961.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11961.3423
    time elapsed:                        180.0247s
    total number of events:              2153337

Latency (ms):
         min:                                    0.12
         avg:                                    1.34
         max:                                   88.25
         95th percentile:                        2.61
         sum:                              2878536.71

Threads fairness:
    events (avg/stddev):           134583.5625/1736.87
    execution time (avg/stddev):   179.9085/0.01

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 11900.83 qps: 11900.83 (r/w/o: 11900.83/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 11612.61 qps: 11612.61 (r/w/o: 11612.61/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 11637.39 qps: 11637.39 (r/w/o: 11637.39/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 11674.48 qps: 11674.48 (r/w/o: 11674.48/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 11661.63 qps: 11661.63 (r/w/o: 11661.63/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 11645.62 qps: 11645.62 (r/w/o: 11645.62/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 11562.17 qps: 11562.17 (r/w/o: 11562.17/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 11570.39 qps: 11570.39 (r/w/o: 11570.39/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 11536.53 qps: 11536.53 (r/w/o: 11536.53/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 11637.83 qps: 11637.83 (r/w/o: 11637.83/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 11184.07 qps: 11184.07 (r/w/o: 11184.07/0.00/0.00) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 11454.11 qps: 11454.11 (r/w/o: 11454.11/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 32 tps: 11683.81 qps: 11683.81 (r/w/o: 11683.81/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 11690.06 qps: 11690.06 (r/w/o: 11690.06/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 32 tps: 11365.98 qps: 11365.98 (r/w/o: 11365.98/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 11456.87 qps: 11456.87 (r/w/o: 11456.87/0.00/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 32 tps: 11671.50 qps: 11671.50 (r/w/o: 11671.50/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 11594.87 qps: 11594.87 (r/w/o: 11594.87/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2086401
        write:                           0
        other:                           0
        total:                           2086401
    transactions:                        2086401 (11585.70 per sec.)
    queries:                             2086401 (11585.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11585.7041
    time elapsed:                        180.0841s
    total number of events:              2086401

Latency (ms):
         min:                                    0.13
         avg:                                    2.76
         max:                                   88.13
         95th percentile:                        6.09
         sum:                              5758904.42

Threads fairness:
    events (avg/stddev):           65200.0312/558.30
    execution time (avg/stddev):   179.9658/0.02

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 11068.47 qps: 11068.47 (r/w/o: 11068.47/0.00/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 10964.56 qps: 10964.56 (r/w/o: 10964.56/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 11202.50 qps: 11202.50 (r/w/o: 11202.50/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 11138.41 qps: 11138.41 (r/w/o: 11138.41/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 10903.31 qps: 10903.31 (r/w/o: 10903.31/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 11168.67 qps: 11168.67 (r/w/o: 11168.67/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 10510.70 qps: 10510.70 (r/w/o: 10510.70/0.00/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 10892.59 qps: 10892.59 (r/w/o: 10892.59/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 10862.24 qps: 10862.24 (r/w/o: 10862.24/0.00/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 10062.33 qps: 10062.33 (r/w/o: 10062.33/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 9480.48 qps: 9480.48 (r/w/o: 9480.48/0.00/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 10060.03 qps: 10060.03 (r/w/o: 10060.03/0.00/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 64 tps: 8890.62 qps: 8890.62 (r/w/o: 8890.62/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 64 tps: 8994.94 qps: 8994.94 (r/w/o: 8994.94/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 64 tps: 9632.36 qps: 9632.36 (r/w/o: 9632.36/0.00/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 64 tps: 8642.34 qps: 8642.34 (r/w/o: 8642.34/0.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 64 tps: 9483.17 qps: 9483.17 (r/w/o: 9483.17/0.00/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1836039
        write:                           0
        other:                           0
        total:                           1836039
    transactions:                        1836039 (10193.78 per sec.)
    queries:                             1836039 (10193.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      10193.7778
    time elapsed:                        180.1137s
    total number of events:              1836039

Latency (ms):
         min:                                    0.13
         avg:                                    6.27
         max:                                  598.46
         95th percentile:                       16.12
         sum:                             11517939.12

Threads fairness:
    events (avg/stddev):           28688.1094/133.32
    execution time (avg/stddev):   179.9678/0.07